app/Controllers/gudang/BahanBaku.php

    public function index()
    {
        $model = new BahanBakuModel();
        $semuaBahanBaku = $model->findAll();
---
SELECT *
FROM `bahan_baku`

    public function edit($id = null)
    {
        $model = new BahanBakuModel();
        $bahan = $model->find($id);
---
SELECT *
FROM `bahan_baku`
WHERE `bahan_baku`.`id` = '6'

    public function delete($id = null)
    {
        $model = new BahanBakuModel();
        $bahan = $model->find($id);

        if (!$bahan) {
            return redirect()->to('/gudang/bahanbaku')->with('error', 'Bahan tidak ditemukan.');
        }

        $isExpired = strtotime($bahan['tanggal_kadaluarsa']) < strtotime(date('Y-m-d'));

        if ($isExpired) {
            // Baris ini sekarang akan berjalan
            $model->delete($id);
---
SELECT *
FROM `bahan_baku`
WHERE `bahan_baku`.`id` = '3'
DELETE FROM `bahan_baku`
WHERE `id` IN ('3')