app/Controllers/gudang/BahanBaku.php

    public function create()
    {
        $model = new BahanBakuModel();


        $data = [
            'nama' => $this->request->getPost('nama'),
            'kategori' => $this->request->getPost('kategori'),
            'jumlah' => $this->request->getPost('jumlah'),
            'satuan' => $this->request->getPost('satuan'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
            'tanggal_kadaluarsa' => $this->request->getPost('tanggal_kadaluarsa'),
            'status' => 'tersedia',
            'created_at' => date('Y-m-d H:i:s')
        ];

        if ($model->save($data)) {
---
INSERT INTO `bahan_baku` (`nama`, `kategori`, `jumlah`, `satuan`, `tanggal_masuk`, `tanggal_kadaluarsa`, `status`, `created_at`) VALUES ('Sawi', 'Sayuran', '12', 'kg', '2025-10-01', '2025-10-24', 'tersedia', '2025-10-03 09:13:02')