app/Controllers/gudang/Permintaan.php

    public function index()
    {
        $permintaanModel = new PermintaanModel();
        $data['permintaan'] = $permintaanModel
            ->select('permintaan.*, user.name as nama_pemohon')
            ->join('user', 'user.id = permintaan.pemohon_id')
            ->orderBy('permintaan.created_at', 'ASC')
            ->findAll();
---
SELECT `permintaan`.*, `user`.`name` as `nama_pemohon`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
ORDER BY `permintaan`.`created_at` DESC

    public function show($id = null)
    {
        $permintaanModel = new PermintaanModel();
        $permintaanDetailModel = new PermintaanDetailModel();

        $permintaan = $permintaanModel
            ->select('permintaan.*, user.name as nama_pemohon')
            ->join('user', 'user.id = permintaan.pemohon_id')
            ->find($id);

        if (!$permintaan) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Permintaan tidak ditemukan.');
        }

        $detail_bahan = $permintaanDetailModel
            ->select('permintaan_detail.*, bahan_baku.nama, bahan_baku.satuan, bahan_baku.jumlah as stok_saat_ini')
            ->join('bahan_baku', 'bahan_baku.id = permintaan_detail.bahan_id')
            ->where('permintaan_id', $id)
            ->findAll();
---
SELECT `permintaan`.*, `user`.`name` as `nama_pemohon`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
WHERE `permintaan`.`id` = '16'
SELECT `permintaan_detail`.*, `bahan_baku`.`nama`, `bahan_baku`.`satuan`, `bahan_baku`.`jumlah` as `stok_saat_ini`
FROM `permintaan_detail`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `permintaan_detail`.`bahan_id`
WHERE `permintaan_id` = '16'

    public function updateStatus($id = null)
    {
        $permintaanModel = new PermintaanModel();
        $bahanBakuModel = new BahanBakuModel();
        $permintaanDetailModel = new PermintaanDetailModel();

        $newStatus = $this->request->getPost('status');

        if (!in_array($newStatus, ['disetujui', 'ditolak'])) {
            return $this->response->setStatusCode(400)->setJSON(['success' => false, 'message' => 'Aksi tidak valid.']);
        }

        if ($newStatus === 'disetujui') {
            $detail_bahan = $permintaanDetailModel->where('permintaan_id', $id)->findAll();
---
SELECT *
FROM `permintaan_detail`
WHERE `permintaan_id` = '7'

            }

        } else {
            $permintaanModel->update($id, ['status' => 'ditolak']);
---
UPDATE `permintaan` SET `status` = 'disetujui'
WHERE `permintaan`.`id` IN ('7')