app/Controllers/gudang/Permintaan.php

    public function index()
    {
        $permintaanModel = new PermintaanModel();

        // Mengambil semua data permintaan dan menggabungkannya dengan data user (pemohon)
        $data['permintaan'] = $permintaanModel
            ->select('permintaan.*, user.name as nama_pemohon')
            ->join('user', 'user.id = permintaan.pemohon_id')
            ->findAll();
---
SELECT `permintaan`.*, `user`.`name` as `nama_pemohon`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`