app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'yanti.dapur@mgb.id'
 LIMIT 1
---
    public function loginProcess()
    {
        // 1. Validasi Input
        if (!$this->validate([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[3]'
        ])) {
            session()->setFlashdata('errors', $this->validator->getErrors());
            return redirect()->back()->withInput();
        }

        // 2. Ambil dan bersihkan input
        $email = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        // 3. Cari user berdasarkan email
        $user = $this->userModel->where('email', $email)->first();