app/Controllers/Permintaan.php

SELECT `p`.*, `u`.`name` as `user_name`
FROM `permintaan` `p`
LEFT JOIN `user` `u` ON `u`.`id` = `p`.`pemohon_id`
ORDER BY `created_at` ASC
---
    public function approvalList()
    {
        if ($this->session->get('role') !== 'gudang') {
            session()->setFlashdata('error', 'Akses ditolak.');
            return redirect()->to(base_url('dashboard'));
        }

        // DIPERBAIKI: JOIN ke tabel 'user' dan SELECT 'u.name'
        $listPermintaan = $this->db->table('permintaan p')
            ->select('p.*, u.name as user_name') // Mengambil nama dari kolom 'name'
            ->join('user u', 'u.id = p.pemohon_id', 'left') // JOIN ke tabel 'user' menggunakan 'pemohon_id'
            ->orderBy('created_at', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `permintaan`
WHERE `permintaan`.`id` = '1'
SELECT `dp`.*, `bb`.`nama` as `bahan_nama`, `bb`.`satuan`, `bb`.`jumlah` as `stok_saat_ini`
FROM `permintaan_detail` `dp`
LEFT JOIN `bahan_baku` `bb` ON `bb`.`id` = `dp`.`bahan_id`
WHERE `dp`.`permintaan_id` = '1'
SELECT `name`
FROM `user`
WHERE `id` = '6'
---
    public function detail($permintaanId)
    {
        $permintaan = $this->permintaanModel->find($permintaanId);

        if (!$permintaan) {
            session()->setFlashdata('error', 'Permintaan tidak ditemukan.');
            return redirect()->back();
        }

        $role = $this->session->get('role');

        // Cek akses: hanya pemohon atau Gudang
        if ($role !== 'gudang' && $permintaan['pemohon_id'] !== $this->session->get('user_id')) { // DIPERBAIKI: pakai pemohon_id
            session()->setFlashdata('error', 'Anda tidak memiliki akses ke permintaan ini.');
            return redirect()->to(base_url('dashboard'));
        }

        // Ambil detail permintaan dan gabungkan dengan stok Bahan Baku
        $details = $this->db->table('permintaan_detail dp')
            ->select('dp.*, bb.nama as bahan_nama, bb.satuan, bb.jumlah as stok_saat_ini')
            ->join('bahan_baku bb', 'bb.id = dp.bahan_id', 'left') // DIPERBAIKI: kolom dp.bahan_id
            ->where('dp.permintaan_id', $permintaanId)
            ->get()
            ->getResultArray();

        // DIPERBAIKI: SELECT dari tabel 'user' dan kolom 'name'
        $user = $this->db->table('user')->select('name')->where('id', $permintaan['pemohon_id'])->get()->getRow();